/* (C) 2003-2013 Willem Jan Hengeveld <itsme@xs4all.nl>
 * Web: http://www.xs4all.nl/~itsme/
 *
 */
#include <fstream>
#include <iostream>
#include <iomanip>
#include <cassert>
#include <string>
#include <vector>

#include <boost/format.hpp>

#ifdef _WIN32
#include <windows.h>
#include <tlhelp32.h>
#endif

// headers from the idasdk
#include "pro.h"     // for basic types.
#include "ida.hpp"   // for ida constants and types.
#include "idp.hpp"   // for interface version
#include "dbg.hpp"   // for 'dbg' global variable
#include "netnode.hpp"  // for RootNode

#include "expr.hpp"  // for IDCFuncs

#if IDA_SDK_VERSION >= 700
typedef ext_idcfunc_t extfun_t;

struct funcset_t {
  int qnty;                     ///< Number of functions
  ext_idcfunc_t *f;                  ///< Function table
};
funcset_t *find_idcfuncs()
{
    uint64_t *p = (uint64_t*)&callui;
    uint64_t *pend = (uint64_t*)&dbg;
    p++;
    while (p<pend && *p==0)
        p++;
    uint64_t addr_fnlist = (uint64_t )p;

    while (p<pend) {
        if (0x100 < *p && *p < 0x1000) {
            if (p[1]!=addr_fnlist) {
                msg("expected to find addr list after count %lld\n", p[0]);
            }
            break;
        }
        if (*p==addr_fnlist) {
            msg("expected to find count %lld before fnlist\n", p[-1]);
            p--;
            break;
        }
        p++;
    }
    if (p==pend) {
        msg("could not find fset\n");
        return nullptr;
    }

    uint32_t *pd = (uint32_t *)(p+9);
#ifdef IDA70BETA3
    typedef size_t (*ea2str_fn)(ea_t ea, char *buf, size_t bufsize);
#else
    typedef size_t (*ea2str_fn)(char *buf, size_t bufsize, ea_t ea);
#endif

    msg("fnlist = %llx, ea2str = %llx\n", addr_fnlist, (uint64_t)ea2str_fn(ea2str));
    msg("found idcfuncs @%p: %lld,  %llx, %llx, %llx, %llx,  %lld,  %llx, %llx, %llx, %d, %d, %d, %d\n",
            p,  p[0],  p[1], p[2], p[3], p[4],  p[5],  p[6], p[7], p[8],  pd[0], pd[1], pd[2], pd[3]);
    return (funcset_t*)p;
}


// memlayout:
// _callui   = sub_...
// ext_idcfunc_t fnlist[0x1ef] = { { }, ... }
// funcset_t IDCFuncs { 0x1ef, fnlist, sub, sub, sub, 0, netnode_inited, ea2str, sub, (int)9, 10, 15, 18, 7 }
//

funcset_t dummyfuncs = {0, nullptr};
funcset_t &IDCFuncs = dummyfuncs;
#endif

typedef std::vector<char> CharVector;

typedef struct {
    char  *function_name;      // 00
    char  *end_function_name;  // 04
    uint32_t w1;                  // 08
    uint32_t w2;                  // 0c
    uint8_t *after_end_fnname;   // 10
    uint32_t w4;                  // 14
    uint32_t nrparams;            // 18
    uint8_t *body;               // 1c
    uint8_t *end_body;           // 20
    uint32_t w5;                  // 24
    uint32_t w6;                  // 28
    uint32_t w7;                  // 2c
    uint32_t w8;                  // 30
} compiled_func1_t;

typedef struct {
    char  *function_name;      // 00
    char  *end_function_name;  // 04
    uint32_t w1;                  // 08
    uint32_t w2;                  // 0c
    uint8_t *after_end_fnname;   // 10
    uint32_t w4;                  // 14
    uint32_t nrparams;            // 18
    uint8_t *body;               // 1c
    uint32_t bodysize;            // 20
    uint32_t w5;                  // 24
} compiled_func2_t;

// ida530 and later
typedef struct {
    char *function_name;
    uint32_t namelen;
    uint32_t namelen2;
    uint32_t nrparams;
    uint8_t *body;
    uint32_t bodysize;
    uint32_t roundedbodysize;
} compiled_func3_t;

typedef struct {
    uint32_t unk0;
    char *filename;
    uint32_t namelen;
    uint32_t name_alloced;
} srcfile4_t;
#undef PACKED
#ifdef _WIN32
#define PACKED
#pragma pack(push,1)
#else
#define PACKED __attribute__((packed))
#endif
typedef struct PACKED {
    uint32_t unk0;
    char *filename;
    uint64_t namelen;
    uint64_t name_alloced;
} srcfile6_t;
#undef PACKED
#ifdef _WIN32
#pragma pack(pop)
#else
#define PACKED __attribute__((packed))
#endif

typedef struct {
    uint32_t ofs;
    uint32_t linenr;
} linenr4_t;
typedef struct {
    char *function_name;
    uint32_t namelen;
    uint32_t name_alloced;
    uint32_t nrparams;
    uint8_t *body;
    uint32_t bodysize;
    uint32_t body_alloced;
